//'use strict' - пример испольщзования при создании переменной
//a =5;
//console.log(a);

console.log("arr" + " - object"); //строка
console.log(4 + " - object");//строка

// let answer = +prompt("Есть ли вам 18 лет?"); // с + будет преобразование string в number

let ink = 10,
 dec = 10; //при перечисление можно ставить запятую, 
//префиксная форма возвращает результат сразу, постфиксная форма после 
ink++;
dec--;

console.log(ink);
console.log(dec);
console.log(5%2); //остаток от деления
// = присваивание == проверка на равенство === строгое соответствие по типу
console.log("2"==2); // сравнение по значению
console.log("2"===2);// сравнение по типу
//& = и || или  
//** - степень 3 ** 2

